{"keras_version": "2.2.5", "config": {"name": "sequential_1", "build_input_shape": [null, 20, 12, 3], "layers": [{"config": {"kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "activation": "relu", "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "filters": 32, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "trainable": true, "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [5, 5], "use_bias": true, "activity_regularizer": null, "activation": "relu", "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "filters": 64, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "trainable": true, "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [5, 3], "use_bias": true, "activity_regularizer": null, "activation": "relu", "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "filters": 128, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "strides": [2, 2], "trainable": true, "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 1], "use_bias": true, "activity_regularizer": null, "activation": "relu", "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "filters": 256, "kernel_regularizer": null, "padding": "same", "strides": [1, 1], "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "activity_regularizer": null, "activation": "relu", "units": 512, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"use_bias": true, "activity_regularizer": null, "activation": "relu", "units": 64, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"use_bias": true, "activity_regularizer": null, "activation": "softmax", "units": 34, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "trainable": true, "dtype": "float32", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential"}