{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.5", "config": {"layers": [{"class_name": "Conv2D", "config": {"kernel_constraint": null, "activation": "relu", "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_1", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "dtype": "float32", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "activation": "relu", "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_2", "kernel_size": [5, 5], "activity_regularizer": null, "filters": 64, "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "dtype": "float32", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "activation": "relu", "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_3", "kernel_size": [5, 3], "activity_regularizer": null, "filters": 128, "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "dtype": "float32", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_3"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "activation": "relu", "bias_constraint": null, "padding": "same", "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_4", "kernel_size": [3, 1], "activity_regularizer": null, "filters": 256, "trainable": true, "dilation_rate": [1, 1]}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1", "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "units": 512, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "name": "dense_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "units": 64, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "relu", "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "name": "dense_2"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "units": 34, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activation": "softmax", "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "name": "dense_3"}}], "name": "sequential_1", "build_input_shape": [null, 20, 12, 3]}}